Plantilla/app/Controllers/Inicio.php

    public function delete($id){
        $model= new UsersModel();
        $model ->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('11')