Plantilla/app/Models/UsersModel.php

    public function getUsers(){

        return $this->findAll();
---
SELECT *
FROM `users`

    public function getUser($id){

        return $this->where('id',$id)->first($id);
---
SELECT *
FROM `users`
WHERE `id` = '8'
 LIMIT 1